<DIV ALIGN=CENTER>

# Introduction to Pandas
## Professor Robert J. Brunner
  
</DIV>  
-----
-----

## Introduction

One of the early criticisms of many in the data science arena of the
Python language was the lack of useful data structures for performing
data analysis tasks. This stemmed in part from comparisons between the R
language and Python, since R has a built-in _DataFrame_ object that
greatly simplified many data analysis tasks. This deficiency was
addressed in 2008 by Wes McKinney with the creation of [Pandas][1] (the
name was originally an abbreviation of Panel datas). To quote the Pandas
documentation:

>Python has long been great for data munging and preparation, but less
>so for data analysis and modeling. pandas helps fill this gap, enabling
>you to carry out your entire data analysis workflow in Python without
>having to switch to a more domain specific language like R.

Pandas introduces several new data structures like the `Series`,
`DataFrame`, and `Panel` that build on top of existing
tools like `numpy` to speed-up data analysis tasks. Pandas also provides
efficient mechanisms for moving data between in memory representations
and different data formats including CSV and text files, JSON files, SQL
databases, HDF5 format files, and even Excel spreadsheets. Pandas also
provides support for dealing with missing or incomplete data and
aggregating or grouping data.

-----
[1]: http://pandas.pydata.org

## Brief introduction to Pandas

Before using Pandas, we must first import the Pandas library:

    import pandas as pd

Second, we simply create and use the appropriate Pandas data structure.
The two most important data structures for typical data science tasks
are the `Series` and the `DataFrame`:

1. `Series`: a one-dimensional labeled array that can hold any data type
such as integers, floating-point numbers, strings, or Python objects. A
`Series` has both a data column and a label column called the _index_.

2. `DataFrame`: a two-dimensional labeled data structure with columns
that can be hold different data types, similar to a spreadsheet or
relational database table. 

Pandas also provides a date/time data structure sometimes refereed to as
a `TimeSeries` and a three-dimensional data structure known as a
`Panel`. 

### `Series`

A `Series` is useful to hold data that should be accesible by using a
specific label. You create a `Series` by passing in an appropriate data
set along with an optional index:

    values = pd.Series(data, index=idx)

The index varies depending on the type of data passed in to create the
`Series:

- if data is a NumPy array, the index should be the same length as the
data array. If no index is provided one will be created that enables
integer access that mirrors a traditional NumPy array (i.e., zero
indexed). 

- if data is a Python dictionary, `idx` can contain specific labels to
indicate which values in the dictionary should be used to create the
`Series`. If no index is specified, an index is created from the sorted
dictionary keys. 

- if data is a scalar value, an inde must be supplied. In this case, the
scalar value will be repeated to ensure that each label in the index has
a value in the `Series`.

These different options are demonstrated in the following code cells.

-----
[df]: http://pandas.pydata.org/pandas-docs/stable/dsintro.html#dataframe

In [1]:
import pandas as pd
import numpy as np

# We label the random values
s1 = pd.Series(np.random.rand(6), index=['q', 'w', 'e', 'r', 't', 'y'])

print(s1)

q    0.721990
w    0.236611
e    0.994790
r    0.418525
t    0.775141
y    0.917286
dtype: float64

In [2]:
d = {'q': 11, 'w': 21, 'e': 31, 'r': 41}

# We pick out the q, w, and r keys, but have an undefined y key.
s2 = pd.Series(d, index = ['q', 'w', 'r', 'y'])

print(s2)

q    11
w    21
r    41
y   NaN
dtype: float64

In [3]:
# We create a Series from an integer constant with explicit labels
s3 = pd.Series(42, index = ['q', 'w', 'e', 'r', 't', 'y'])

print(s3)

print('\nThe "e" value is ', s3['e'])

q    42
w    42
e    42
r    42
t    42
y    42
dtype: int64

The "e" value is  42

In [4]:
# We can slice like NumPy arrays

print(s1[:-2])

# We can also perform vectorized operations
print('\nSum Series:')
print(s1 + s3)
print('\nSeries operations:')
print(s2 * 5 - 1.2)

q    0.721990
w    0.236611
e    0.994790
r    0.418525
dtype: float64

Sum Series:
q    42.721990
w    42.236611
e    42.994790
r    42.418525
t    42.775141
y    42.917286
dtype: float64

Series operations:
q     53.8
w    103.8
r    203.8
y      NaN
dtype: float64

-----

### `DataFrame`

The second major data structure that Pandas provdis is he `DataFrame`,
which is a two-dimensional array, where each column is effectively a
`Series` with a shared index. A DataFrame is a very powerful data
structure and provides a nice mapping for a number of different data
formats (and storage mechanisms). For example, you can easily read data
from a CSV file, a fixed width format text file, a JSOPN file, an HTML
file, and HDF file, and a relational database into a Pandas `DataFrame`.
This is demonstrated in the next set of code cells, where we extract
data from files we created in the [Introduction to Data
Formats][df] Notebook.

-----
[df]: dataformats.ipynb

In [5]:
# Read data from CSV file, and display subset

dfa = pd.read_csv('data.csv', delimiter='|', index_col='iata')

# We can grab the first five rows, and only extract the 'airport' column
print(dfa[['airport', 'city', 'state']].head(5))

                   airport              city state
iata
00M               Thigpen        Bay Springs    MS
00R   Livingston Municipal        Livingston    TX
00V            Meadow Lake  Colorado Springs    CO
01G           Perry-Warsaw             Perry    NY
01J       Hilliard Airpark          Hilliard    FL

In [6]:
# Read data from our JSON file
dfb = pd.read_json('data.json')

# Grab the last five rows
print(dfb[[0, 1, 2, 3, 5, 6]].tail(5))

        0                          1            2   3         5         6
3372  ZEF            Elkin Municipal        Elkin  NC  36.28002 -80.78607
3373  ZER  Schuylkill Cty/Joe Zerbey   Pottsville  PA  40.70645 -76.37315
3374  ZPH      Zephyrhills Municipal  Zephyrhills  FL  28.22806 -82.15592
3375  ZUN                 Black Rock         Zuni  NM  35.08323 -108.7918
3376  ZZV       Zanesville Municipal   Zanesville  OH  39.94446 -81.89211

-----

In the previous code cells, we read data first from a delimiter
separated value file and second from a JSON file into a Pandas
`DataFrame`. In each code cell, we display data contained in the new
DataFrame, first by using the `head` method to display the first few
rows, and second by using the `tail` method to display the last few
lines. For the delimiter separated value file, we explicitly specified
the delimiter, which is a vertical bar `|`, the default is to assume a
comma as the delimiter. We also explicitly specify the `iata` column
should be used as the index column, which is how we can refer to rows in
the array. 

We also explicitly select columns for display in both code cells. In the
first code cell, we explicitly name the columns, passing in a list of
the names to the DataFrame. Alternatively, in the second code cell, we
pass in a list of the column ids, which we must do since we did not
create named columns when reading data from the JSON file. The list of
integers can be used even if the columns of the array have been assigned
names.

Pandas includes a tremendous amount of functionality, especially for
the `DataFrame`, to learn more, view the [detailed documentation][pdd].
Several useful functions are demonstrated below, however, including
information summaries, slicing, and column operations on DataFrames.

-----

[pdd]: http://pandas.pydata.org/pandas-docs/stable/dsintro.html#dataframe

In [7]:
# Lets look at the datatypes of each column
dfa.dtypes

airport     object
city        object
state       object
country     object
lat        float64
long       float64
dtype: object

In [8]:
# We can get a summary of numerical information in the dataframe

dfa.describe()

               lat         long
count  3376.000000  3376.000000
mean     40.036524   -98.621205
std       8.329559    22.869458
min       7.367222  -176.646031
25%      34.688427  -108.761121
50%      39.434449   -93.599425
75%      43.372612   -84.137519
max      71.285448   145.621384

In [9]:
# Notice the JSON data did not automatically specify data types
dfb.dtypes

0    object
1    object
2    object
3    object
4    object
5    object
6    object
dtype: object

In [10]:
# This affects the output of the describe method, dfb has no numerical data types.

dfb.describe()

           0          1     2     3     4            5            6
count   3377       3377  3377  3377  3377  3377.000000  3377.000000
unique  3377       3246  2677    58     6  3376.000000  3376.000000
top      GUY  Municipal    NA    AK   USA    41.610333   -88.915616
freq       1          5    12   263  3372     2.000000     2.000000

In [11]:
# We can slice out rows using the indicated index for dfa

print(dfa.loc[['00V', '11R', '12C']])

                 airport              city state country        lat  \
iata
00V          Meadow Lake  Colorado Springs    CO     USA  38.945749
11R    Brenham Municipal           Brenham    TX     USA  30.219000
12C   Rochelle Municipal          Rochelle    IL     USA  41.893001

            long
iata
00V  -104.569893
11R   -96.374278
12C   -89.078290

In [12]:
# We can slice out rows using the row index for dfb
print(dfb[100:105])

       0                   1         2   3    4         5         6
100  11J        Early County   Blakely  GA  USA  31.39699 -84.89526
101  11R   Brenham Municipal   Brenham  TX  USA    30.219 -96.37428
102  12C  Rochelle Municipal  Rochelle  IL  USA    41.893 -89.07829
103  12D     Tower Municipal     Tower  MN  USA  47.81833 -92.29167
104  12J   Brewton Municipal   Brewton  AL  USA  31.05126 -87.06797

In [13]:
# We can also select rows based on boolean tests on columns
print(dfa[(dfa.lat > 48) & (dfa.long < -170)])

       airport      city state country        lat        long
iata
ADK       Adak      Adak    AK     USA  51.877964 -176.646031
AKA       Atka      Atka    AK     USA  52.220348 -174.206350
GAM    Gambell   Gambell    AK     USA  63.766766 -171.732824
SNP   St. Paul  St. Paul    AK     USA  57.167333 -170.220444
SVA   Savoonga  Savoonga    AK     USA  63.686394 -170.492636

-----

We can also perform numerical operations on a `DataFrame`, just as was the
case with NumPy arrays. To demonstrate this, we create a numerical
DataFrame, apply different operations, and view the results.

-----

In [14]:
df = pd.DataFrame(np.random.randn(5, 6))

print(df)

          0         1         2         3         4         5
0 -0.081686 -0.778009 -0.640970  0.996453  1.142358 -0.688399
1  0.184744  0.482777  1.294283 -0.311165 -0.365347  0.820360
2  0.600033 -0.946207 -0.539372  0.097345  0.901086  0.009482
3 -0.691284 -1.001558 -0.072856  0.691576 -1.336217 -0.580029
4 -0.801537 -0.101565  1.392538  0.532039  1.624052  0.701913

In [15]:
# We can incorporate operate with basic scalar values

df + 2.5

          0         1         2         3         4         5
0  2.418314  1.721991  1.859030  3.496453  3.642358  1.811601
1  2.684744  2.982777  3.794283  2.188835  2.134653  3.320360
2  3.100033  1.553793  1.960628  2.597345  3.401086  2.509482
3  1.808716  1.498442  2.427144  3.191576  1.163783  1.919971
4  1.698463  2.398435  3.892538  3.032039  4.124052  3.201913

In [16]:
# And perform more complex scalar operations

-1.0 * df + 3.5

          0         1         2         3         4         5
0  3.581686  4.278009  4.140970  2.503547  2.357642  4.188399
1  3.315256  3.017223  2.205717  3.811165  3.865347  2.679640
2  2.899967  4.446207  4.039372  3.402655  2.598914  3.490518
3  4.191284  4.501558  3.572856  2.808424  4.836217  4.080029
4  4.301537  3.601565  2.107462  2.967961  1.875948  2.798087

In [17]:
# We can also apply vectorized functions

np.sin(df)

          0         1         2         3         4         5
0 -0.081595 -0.701863 -0.597973  0.839549  0.909616 -0.635301
1  0.183695  0.464241  0.962013 -0.306167 -0.357274  0.731392
2  0.564669 -0.811203 -0.513597  0.097191  0.784001  0.009482
3 -0.637527 -0.842312 -0.072791  0.637752 -0.972612 -0.548049
4 -0.718426 -0.101391  0.984154  0.507292  0.998582  0.645679

In [18]:
# We can tranpose the dataframe

df.T

          0         1         2         3         4
0 -0.081686  0.184744  0.600033 -0.691284 -0.801537
1 -0.778009  0.482777 -0.946207 -1.001558 -0.101565
2 -0.640970  1.294283 -0.539372 -0.072856  1.392538
3  0.996453 -0.311165  0.097345  0.691576  0.532039
4  1.142358 -0.365347  0.901086 -1.336217  1.624052
5 -0.688399  0.820360  0.009482 -0.580029  0.701913

-----

The above description merely scratches the surface of what you can do
with a Pandas `Series` or a `DataFrame`. The best way to learn how to
effectively use these data structures is to just do it!

We now will change gears and explore how to use Pandas with a relational 
database.

-----

### Pandas and SQL

After the [Database and Python](3_dbNpy.ipynb) Notebook exploring how to
use standard Python to work with a database, you have probably realized
that there is a lot of standard code we must write to simply execute
some SQL commands. While there are different Python libraries that exist
to simplify these steps, we will focus on using the Pandas library,
which is a standard library for doing _Data Analysis in Python_.

----

In [19]:
import sqlite3 as sl
import pandas as pd

-----

Pandas provides built-in support for executing a SQL query and
retrieving the result as a DataFrame. This is demonstrated in the next
code cell, where we execute a SQL query on the airlines database. We
select several columns, and for simplicity we restrict our query result
to only ten rows by using the ANSI SQL `LIMIT` clause.

The Pandas method to execute a SQL statement is `read_sql`, and mimics
in appearance other Panda methods for _reading_ data into a Pandas
DataFrame. In this case, the method takes our SQL statement, database
connection, and an optional parameter, `index_col` that we can use to
specify which column in our result should be treated as an index column.
Pandas will supply an auto-incrementing column if no column is explicitly
supplied. To save space in the output display, we specify our own column
in these examples.


-----

In [20]:
query = "SELECT code, airport, city, state, latitude, longitude FROM airports LIMIT 10 ;"

database = '/home/data_scientist/database/rppds'

with sl.connect(database) as con:
    data = pd.read_sql(query, con, index_col ='code')
    
    print(data)

                   airport              city  state  latitude longitude
code
iata               airport              city  state       lat      long
00M               Thigpen        Bay Springs     MS  31.95376  -89.2345
00R   Livingston Municipal        Livingston     TX  30.68586 -95.01793
00V            Meadow Lake  Colorado Springs     CO  38.94575 -104.5699
01G           Perry-Warsaw             Perry     NY  42.74135 -78.05208
01J       Hilliard Airpark          Hilliard     FL  30.68801 -81.90594
01M      Tishomingo County           Belmont     MS  34.49167 -88.20111
02A            Gragg-Wade            Clanton     AL  32.85049 -86.61145
02C                Capitol        Brookfield     WI  43.08751 -88.17787
02G      Columbiana County    East Liverpool     OH  40.67331 -80.64141

-----

In the next code cell, we use the column selection feature with a Pandas
DataFrame to select only those rows that have airports in the state of
Mississippi. We do this by selecting the `state` attribute of the
DataFrame, which corresponds to the _state_ column, and applying a
Boolean condition.

-----

In [21]:
query = "SELECT code, airport, city, state, latitude, longitude FROM airports LIMIT 100 ;"

with sl.connect(database) as con:
    data = pd.read_sql(query, con, index_col ='code')
    
    print(data[data.state == 'MS'])

                     airport         city state  latitude longitude
code
00M                 Thigpen   Bay Springs    MS  31.95376  -89.2345
01M        Tishomingo County      Belmont    MS  34.49167 -88.20111
04M           Calhoun County    Pittsboro    MS  33.93011 -89.34285
06M         Eupora Municipal       Eupora    MS  33.53457 -89.31257
08M    Carthage-Leake County     Carthage    MS  32.76125 -89.53007
09M     Charleston Municipal   Charleston    MS   33.9915 -90.07815
0M6            Panola County   Batesville    MS  34.36677 -89.90009
0R0   Columbia-Marion County     Columbia    MS  31.29701 -89.81283

-----

Pandas also simplifies the insertion of new data into a SQL database.
For this, we can simply take an existing Pandas DataFrame and call the
`to_sql()` method. This method requires two parameters, the name of the
database table, and the database connection. If the table does not
exist, a new table will be created to match the DataFrame, including
appropriate column names and data types. 

In the next two code blocks, we first query the airports table, and use
Pandas to extract all airports in Illinois. We next insert this data
back into our database as a new table called `ILAirports`. The following
code block queries this new table and display the results for
confirmation.

-----

In [22]:
# Creating table automatically works better if columns are explicitly listed.

query = "SELECT code, airport, city, state, latitude, longitude FROM airports ;"
with sl.connect(database) as con:
    data = pd.read_sql(query, con)

    data[data.state == 'IL'].to_sql('ILAirports', con)

In [23]:
with sl.connect(database) as con:
    data = pd.read_sql('SELECT code, city, airport, latitude, longitude FROM ILAirports', 
                       con, index_col ='code')
    
    print(data[10:20])

                       city                airport   latitude  longitude
code
3CK       Lake In The Hills      Lake In The Hills  42.206803 -88.323040
3K6   Troy/Marine/St. Louis    St Louis-Metro East  38.732909 -89.806567
3LC                 Lincoln           Logan County  40.158472 -89.334972
3LF              Litchfield   Litchfield Municipal  39.166353 -89.674897
3MY                  Peoria   Mt. Hawley Auxiliary  40.795259 -89.613403
9I0                  Havana        Havana Regional  40.221155 -90.022894
AJG               Mt Carmel    Mt Carmel Municipal  38.606547 -87.726694
ALN         Alton/St. Louis     St. Louis Regional  38.890291 -90.046043
ARR          Chicago/Aurora       Aurora Municipal  41.771929 -88.475659
BLV    Belleville/St. Louis  Scott AFB/MidAmerica   38.545179 -89.835184

### Additional References

1. [Pandas Documentation][pdd]
2. A slightly dated Pandas [tutorial][pdt]
-----

[pdd]: http://pandas.pydata.org/pandas-docs/stable/index.html
[pdt]: http://www.gregreda.com/2013/10/26/intro-to-pandas-data-structures/

### Return to the [Course Index](index.ipynb).

-----